app/Controllers/About.php

SELECT *
FROM `pendidikan`
SELECT *
FROM `pengalaman`
SELECT *
FROM `keahlian`
SELECT *
FROM `portofolio`
SELECT *
FROM `biodata`
 LIMIT 1
---
    public function index()
    {
        $pendidikan = (new PendidikanModel())->findAll();
        $pengalaman = (new PengalamanModel())->findAll();
        $keahlian   = (new KeahlianModel())->findAll();
        $portofolio = (new PortofolioModel())->findAll();
        $sosial     = (new SosialModel())->findAll();
        $biodata    = (new BiodataModel())->first();