app/Controllers/Home.php

SELECT *
FROM `pengalaman`
WHERE `jenis` = 'Kerja'
SELECT *
FROM `pengalaman`
WHERE `jenis` = 'Kepanitiaan'
SELECT *
FROM `sosial_media`
SELECT *
FROM `biodata`
 LIMIT 1
SELECT *
FROM `pendidikan`
SELECT *
FROM `portofolio`
SELECT *
FROM `minat`
SELECT *
FROM `keahlian`
---
    public function index()
    {
        $biodataModel = new BiodataModel();
        $pendidikanModel = new PendidikanModel();
        $pengalamanModel = new PengalamanModel();
        $portofolioModel = new PortofolioModel();
        $minatModel = new MinatModel();
        $keahlianModel = new KeahlianModel();
        $sosialModel = new SosialModel();

        // Ambil data pengalaman kerja & kepanitiaan dari satu tabel
        $pengalaman = $pengalamanModel->where('jenis', 'Kerja')->findAll();
        $kepanitiaan = $pengalamanModel->where('jenis', 'Kepanitiaan')->findAll();

        $data = [
            'biodata'      => $biodataModel->first(),
            'pendidikan'   => $pendidikanModel->findAll(),
            'pengalaman'   => $pengalaman,
            'kepanitiaan'  => $kepanitiaan,
            'portofolio'   => $portofolioModel->findAll(),
            'minat'        => $minatModel->findAll(),
            'keahlian'     => $keahlianModel->findAll(),
            'sosial_media' => $sosialModel->findAll(),
        ];