app/Controllers/Keahlian.php

SELECT *
FROM `keahlian`
SELECT *
FROM `biodata`
 LIMIT 1
SELECT *
FROM `sosial_media`
---
    public function index()
    {
        $keahlianModel = new KeahlianModel();
        $biodataModel = new BiodataModel();
        $sosialMediaModel = new SosialModel();

        $data['keahlian'] = $keahlianModel->findAll();
        $data['biodata'] = $biodataModel->first();
        $data['sosial_media'] = $sosialMediaModel->findAll();