app/Controllers/Pendidikan.php

SELECT *
FROM `pendidikan`
SELECT *
FROM `biodata`
 LIMIT 1
SELECT *
FROM `sosial_media`
---
    public function index()
    {
        $pendidikanModel = new PendidikanModel();
        $biodataModel = new BiodataModel();
        $sosialMediaModel = new SosialModel();

        $data['pendidikan'] = $pendidikanModel->findAll();
        $data['biodata'] = $biodataModel->first();
        $data['sosial_media'] = $sosialMediaModel->findAll();