app/Controllers/Pengalaman.php

SELECT *
FROM `pengalaman`
SELECT *
FROM `biodata`
 LIMIT 1
SELECT *
FROM `sosial_media`
---
    public function index()
    {
        $pengalamanModel = new PengalamanModel();
        $biodataModel = new BiodataModel();
        $sosialMediaModel = new SosialModel();

        $data['pengalaman'] = $pengalamanModel->findAll();
        $data['biodata'] = $biodataModel->first(); // ambil biodata utama
        $data['sosial_media'] = $sosialMediaModel->findAll(); // semua sosial media