app/Controllers/Portofolio.php

    public function index()
    {
        $portofolioModel = new PortofolioModel();
        $biodataModel = new BiodataModel();
        $sosialMediaModel = new SosialModel();

        $data['portofolio'] = $portofolioModel->findAll();
        $data['biodata'] = $biodataModel->first();
        $data['sosial_media'] = $sosialMediaModel->findAll();
---
SELECT *
FROM `portofolio`
SELECT *
FROM `biodata`
 LIMIT 1
SELECT *
FROM `sosial_media`